/*
 * linux/include/asm-arm/arch-as3310/hardware.h
 *
 * Hardware definitions for TI OMAP processors and boards
 *
 * NOTE: Please put device driver specific defines into a separate header
 *	 file for each driver.
 *
 * Copyright (C) 2001 RidgeRun, Inc.
 * Author: RidgeRun, Inc. Greg Lonnon <glonnon@ridgerun.com>
 *
 * Reorganized for Linux-2.6 by Tony Lindgren <tony@atomide.com>
 *                          and Dirk Behme <dirk.behme@de.bosch.com>
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the
 * Free Software Foundation; either version 2 of the License, or (at your
 * option) any later version.
 *
 * THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN
 * NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
 * USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *

                      
/*                        
 * Status register bits.  
 */                       
#define HW_LRADC_STATUS  (HW_LRADC_BASE+0x40)//0x800A4040                        
/*                       
 * Result register bits  
 */                      
#define HW_LRADC_CH0     (HW_LRADC_BASE+0x50)//0x800A4050
#define HW_LRADC_CH1     (HW_LRADC_BASE+0x60)//0x800A4060
#define HW_LRADC_CH2     (HW_LRADC_BASE+0x70)//0x800A4070
#define HW_LRADC_CH3     (HW_LRADC_BASE+0x80)//0x800A4080
#define HW_LRADC_CH4     (HW_LRADC_BASE+0x90)//0x800A4090
#define HW_LRADC_CH5     (HW_LRADC_BASE+0xA0)//0x800A40A0
#define HW_LRADC_CH6     (HW_LRADC_BASE+0xB0)//0x800A40B0
#define HW_LRADC_CH7     (HW_LRADC_BASE+0xC0)//0x800A40C0                        


/*                          
 * Debug register bits      
 */                         
#define HW_LRADC_DEBUG0     (HW_LRADC_BASE+0x110)//0x800A4110
#define HW_LRADC_DEBUG1     (HW_LRADC_BASE+0x120)//0x800A4120
#define HW_LRADC_CONVERSION (HW_LRADC_BASE+0x130)//0x800A4130
                                               
/*
 * ----------------------------------------------------------------------------
 * I2S
 * ----------------------------------------------------------------------------
 */

#define HW_I2SCTRL_CTRL0        (0x80056000)    
#define HW_I2SCTRL_SPCR         (0x80056010)        
#define HW_I2SCTRL_CFG          (0x80056020)        
#define HW_I2SCTRL_DATA         (0x80056030)
#define HW_I2SCTRL_STATUS       (0x80056040)
#define HW_I2SCTRL_EVENT        (0x80056050)

/*
 * ----------------------------------------------------------------------------
 * NOR Flash
 * ----------------------------------------------------------------------------
 */
#define ALPAS3310_NOR_BASE	 		0x00000000
#define ALPAS3310_NOR_SIZE	 		0x00200000

/*
 * ----------------------------------------------------------------------------
 * Camera
 * ----------------------------------------------------------------------------
 */

#define HW_DCMI_CR_ADDR          0x80080000
#define HW_DCMI_SR_ADDR          0x80080010
#define HW_DCMI_RIS_ADDR         0x80080020
#define HW_DCMI_IER_ADDR         0x80080030
#define HW_DCMI_MIS_ADDR         0x80080040
#define HW_DCMI_ICR_ADDR         0x80080050
#define HW_DCMI_ESCR_ADDR        0x80080060
#define HW_DCMI_ESUR_ADDR        0x80080070
#define HW_DCMI_CWSTRT_ADDR    0x80080080
#define HW_DCMI_CWSIZE_ADDR    0x80080090
#define HW_DCMI_DR_ADDR           0x800800A0


/* ----------------------------------------------------------------------------*/                                 
#ifndef __ASSEMBLY__                      


/*********************** Register in structure **************************/
                                       
typedef volatile u8		AS3310_REG8;      
typedef volatile u16	AS3310_REG16;     
typedef volatile u32	AS3310_REG32;

#define R_VAL 0
#define R_SET 1
#define R_CLR 2
#define R_TOG 3


/*  ==================  INT Reg defines  =============================*/

typedef struct {
		AS3310_REG32		VECTOR[4];	                //	0x00	R/W		
		AS3310_REG32		LEVELACK[4];                //	0x10	R/W 
		AS3310_REG32		CTRL[4];                    //	0x20	R/W 
		AS3310_REG32		STAT[4];                    //	0x30	R/W 
		AS3310_REG32		RAW0[4];                    //	0x40	R/W 
		AS3310_REG32		RAW1[4];                    //	0x50	R/W 
		AS3310_REG32		PRIORITY0[4];               //	0x60	R/W 
		AS3310_REG32		PRIORITY1[4];               //	0x70	R/W	
		AS3310_REG32		PRIORITY2[4];               //	0x80	R/W
		AS3310_REG32		PRIORITY3[4];               //	0x90	R/W 
		AS3310_REG32		PRIORITY4[4];               //	0xA0	R/W 
		AS3310_REG32		PRIORITY5[4];               //	0xB0	R/W	
		AS3310_REG32		PRIORITY6[4];               //	0xC0	R/W
		AS3310_REG32		PRIORITY7[4];               //	0xD0	R/W   
		AS3310_REG32		PRIORITY8[4];               //	0xE0	R/W
        AS3310_REG32		PRIORITY9[4];               //  0xF0
        AS3310_REG32		PRIORITY10[4];              //  0x100
        AS3310_REG32		PRIORITY11[4];              //  0x110
        AS3310_REG32		PRIORITY12[4];              //  0x120
        AS3310_REG32		PRIORITY13[4];              //  0x130
        AS3310_REG32		PRIORITY14[4];              //  0x140
        AS3310_REG32		PRIORITY15[4];              //  0x150
        AS3310_REG32		VBASE[4];                   //  0x160
        AS3310_REG32		RDEBUG[4];                   //  0x170
        AS3310_REG32		DBGREAD0[4];                //  0x180
        AS3310_REG32		DBGREAD1[4];                //  0x190
        AS3310_REG32		DBGFLAG[4];                 //  0x1A0
        AS3310_REG32		DBGREQUEST0[4];             //  0x1B0
        AS3310_REG32		DBGREQUEST1[4];             //  0x1C0
        AS3310_REG32		CLEAR0[4];                  //  0x1D0
        AS3310_REG32		CLEAR1[4];                  //  0x1E0
        AS3310_REG32		UNDEF_VECTOR[4];            //  0x1F0
} /*__attribute__((__packed__))*/ AS3310_INT_CTRL;

#define AS3310_INT_CTRL_BASE   0x80000000  /* for AS3310D */

static inline AS3310_INT_CTRL * AS3310_GetBase_INT_CTRL(void)
{
	return (AS3310_INT_CTRL *)(IO_ADDRESS(AS3310_INT_CTRL_BASE));
}

/*  ==================  PINCTRL Reg defines  =============================*/

typedef struct _asap18xx_pincontrol_bank{
		AS3310_REG32		CTRL[4]	        ;	//	0x00	R/W		
		AS3310_REG32		MUXSEL0[4]      ;  //	0x10	R/W 
		AS3310_REG32		MUXSEL1[4]      ;  //	0x20	R/W 
		AS3310_REG32		DRIVE[4]	    ;  //	0x30	R/W 
		AS3310_REG32		NOT_USED0[4]    ;  //	0x40	R/W 
		AS3310_REG32		DOUT[4]         ;  //	0x50	R/W 
		AS3310_REG32		DIN[4]          ;  //	0x60	R/W 
		AS3310_REG32		DOE[4]          ;  //	0x70	R/W	
		AS3310_REG32		PIN2IRQ[4]      ;  //	0x80	R/W
		AS3310_REG32		IRQEN[4]        ;  //	0x90	R/W 
		AS3310_REG32		IRQLEVEL[4]     ;  //	0xA0	R/W 
		AS3310_REG32		IRQPOL[4]       ;  //	0xB0	R/W	
		AS3310_REG32		IRQSTAT[4]      ;  //	0xC0	R/W
		AS3310_REG32		PU[4]           ;  //	0xD0	R/W   
		AS3310_REG32		PD[4]           ;  //	0xE0	R/W   
        AS3310_REG32		NOT_USED1[4]    ;  //0xF0
} /*__attribute__((__packed__))*/ ASAP18xx_PIN_CTRL_BANK;

typedef struct _asap18xx_pincontrol{
		ASAP18xx_PIN_CTRL_BANK		BANK[4]	 ;	//	0x100*4	R/W		
} /*__attribute__((__packed__))*/ ASAP18xx_PIN_CTRL;

#define PIN_CTRL_BASE       (0x80018000)

static inline ASAP18xx_PIN_CTRL *  ASAP18xx_GetBase_PinControl(void)
{
	return (ASAP18xx_PIN_CTRL *)(IO_ADDRESS(PIN_CTRL_BASE));
}

/*  ==================  LRADC Reg defines  =============================*/

typedef struct {
		AS3310_REG32		CTRL0[4];	        //	0x00	R/W		
		AS3310_REG32		CTRL1[4];           //	0x10	R/W 
		AS3310_REG32		CTRL2[4];           //	0x20	R/W 
		AS3310_REG32		CTRL3[4];           //	0x30	R/W 
		AS3310_REG32		STATUS[4];          //	0x40	R/W 
		AS3310_REG32		CH0[4];             //	0x50	R/W 
		AS3310_REG32		CH1[4];             //	0x60	R/W 
		AS3310_REG32		CH2[4];             //	0x70	R/W	
		AS3310_REG32		CH3[4];             //	0x80	R/W
		AS3310_REG32		CH4[4];             //	0x90	R/W 
		AS3310_REG32		CH5[4];             //	0xA0	R/W 
		AS3310_REG32		CH6[4];             //	0xB0	R/W	
		AS3310_REG32		CH7[4];             //	0xC0	R/W
		AS3310_REG32		DELAY0[4];          //	0xD0	R/W   
		AS3310_REG32		DELAY1[4];          //	0xE0	R/W
        AS3310_REG32		DELAY2[4];          //  0xF0
        AS3310_REG32		DELAY3[4];          //  0x100
        AS3310_REG32		DEBUG0[4];          //  0x110
        AS3310_REG32		DEBUG1[4];          //  0x120
        AS3310_REG32		CONVERSION[4];      //  0x130
} /*__attribute__((__packed__))*/ AS3310_LRADC_CTRL;

#define AS3310_LRADC_CTRL_BASE   0x80050000  /* for AS3310D */

static inline AS3310_LRADC_CTRL * AS3310_GetBase_LRADC_CTRL(void)
{
	return (AS3310_LRADC_CTRL *)(IO_ADDRESS(AS3310_LRADC_CTRL_BASE));
}

/*  ==================  UARTAPP Reg defines  =============================*/

typedef struct {
		AS3310_REG32		CTRL0[4];	                     //	0x00	R/W		
		AS3310_REG32		CTRL1[4];                        //	0x10	R/W 
		AS3310_REG32		CTRL2[4];                        //	0x20	R/W 
		AS3310_REG32		LINECTRL[4];                     //	0x30	R/W 
		AS3310_REG32		INTR[4];                         //	0x40	R/W 
		AS3310_REG32		DATA[4];  //NO SET CLR TOG       //	0x50	R/W 
		AS3310_REG32		STAT[4];  //NO SET CLR TOG       //	0x60	R/W 
		AS3310_REG32		RDEBUG[4]; //NO SET CLR TOG       //	0x70	R/W	
} /*__attribute__((__packed__))*/ AS3310_UARTAPP_CTRL;

#define AS3310_UARTAPP_CTRL_BASE               0x8006C000 

static inline  AS3310_UARTAPP_CTRL* AS3310_GetBase_UARTAPP_CTRL(void)
{
	return ( AS3310_UARTAPP_CTRL*)(IO_ADDRESS(AS3310_UARTAPP_CTRL_BASE));
}

/*  ==================  LCDIF Reg defines  =============================*/

typedef struct {
		AS3310_REG32		CTRL[4];	                    //	0x00	R/W		
		AS3310_REG32		TIMING[4]; //NO SET CLR TOG     //	0x10	R/W 
		AS3310_REG32		DATA[4];   //NO SET CLR TOG     //	0x20	R/W 
		AS3310_REG32		RDEBUG[4];  //NO SET CLR TOG     //	0x30	R/W 
} AS3310_LCDIF; /*__attribute__((__packed__))*/

#define AS3310_LCDIF_BASE	0x80060000

static inline AS3310_LCDIF * AS3310_GetBase_LCDIF(void)
{
	return (AS3310_LCDIF * ) IO_ADDRESS(AS3310_LCDIF_BASE);
}

/*  ==================  TIMER Reg defines  =============================*/

typedef struct {
		AS3310_REG32		ROTCTRL[4];	                        //	0x00	R/W		
		AS3310_REG32		ROTCOUNT[4];   //NO SET CLR TOG     //	0x10	R/W 
		AS3310_REG32		TIMCTRL0[4];                        //	0x20	R/W 
		AS3310_REG32		TIMCOUNT0[4];  //NO SET CLR TOG     //	0x30	R/W 
		AS3310_REG32		TIMCTRL1[4];                        //	0x40	R/W 
		AS3310_REG32		TIMCOUNT1[4];  //NO SET CLR TOG     //	0x50	R/W 
		AS3310_REG32		TIMCTRL2[4];                        //	0x60	R/W 
		AS3310_REG32		TIMCOUNT2[4];  //NO SET CLR TOG     //	0x70	R/W	
		AS3310_REG32		TIMCTRL3[4];                        //	0x80	R/W
        AS3310_REG32		TIMCOUNT3[4];  //NO SET CLR TOG     //	0x90	R/W 
} /*__attribute__((__packed__))*/ AS3310_TIMER_CTRL;

#define AS3310_TIMER_CTRL_BASE               0x80068000 

static inline  AS3310_TIMER_CTRL* AS3310_GetBase_TIMER_CTRL(void)
{
	return ( AS3310_TIMER_CTRL*)(IO_ADDRESS(AS3310_TIMER_CTRL_BASE));
}
/*  ==================  SSP Reg defines  =============================*/

typedef struct {
		AS3310_REG32		CTRL0[4];	                    //	0x00	R/W		
		AS3310_REG32		CMD0[4];                        //	0x10	R/W 
		AS3310_REG32		CMD1[4];                        //	0x20	R/W 
		AS3310_REG32		COMPREF[4];                     //	0x30	R/W 
		AS3310_REG32		COMPMASK[4];                    //	0x40	R/W 
		AS3310_REG32		TIMING[4];                      //	0x50	R/W 
		AS3310_REG32		CTRL1[4];                       //	0x60	R/W 
		AS3310_REG32		DATA[4];    //NO SET CLR TOG    //	0x70	R/W	
		AS3310_REG32		SDRESP0[4]; //NO SET CLR TOG    //	0x80	R/W
        AS3310_REG32		SDRESP1[4]; //NO SET CLR TOG    //	0x90	R/W 
        AS3310_REG32		SDRESP2[4]; //NO SET CLR TOG    //	0xA0	R/W 
        AS3310_REG32		SDRESP3[4]; //NO SET CLR TOG    //	0xB0	R/W	
        AS3310_REG32		STATUS[4];  //NO SET CLR TOG    //	0xC0	R/W
        AS3310_REG32		RDEBUG[4];   //NO SET CLR TOG    //	0xD0	R/W   
} /*__attribute__((__packed__))*/ AS3310_SSP_CTRL;

#define AS3310_SSP_CTRL_BASE               0x80010000 

static inline  AS3310_SSP_CTRL* AS3310_GetBase_SSP_CTRL(void)
{
	return ( AS3310_SSP_CTRL*)(IO_ADDRESS(AS3310_SSP_CTRL_BASE));
}


/*  ==================  LCD Reg defines  =============================*/

typedef struct {
		AS3310_REG32		CTRL0[4]	 ;	    //	0x00	R/W		
		AS3310_REG32		CTRL1[4]   ;        //	0x10	R/W 
		AS3310_REG32		DATA[4]     ;       //	0x20	R/W 
		AS3310_REG32		TIMING0[4]	 ;      //	0x30	R/W 
		AS3310_REG32		TIMING1[4]   ;      //	0x40	R/W 
		AS3310_REG32		TIMING2[4]   ;      //	0x50	R/W 
		AS3310_REG32		FIFO_STAT[4] ;      //	0x60	R/W 
		AS3310_REG32		STAT[4]      ;      //	0x70	R/W	
		AS3310_REG32		SUBPANEL[4]  ;      //	0x80	R/W
		AS3310_REG32		LINEINT[4]   ;      //	0x90	R/W 
		AS3310_REG32		DISPLAYSTATUS[4];   //	0xA0	R/W 
		AS3310_REG32		MONITOR[4]      ;   //	0xB0	R/W	
		AS3310_REG32		SWITCH[4]     ;     //	0xC0	R/W
		AS3310_REG32		CHECK[4]     ;      //	0xD0	R/W   
		AS3310_REG32		SECURE[4]     ;     //	0xE0	R/W
        AS3310_REG32		U_DATA[4]     ;     //  0xF0
        AS3310_REG32		V_DATA[4]     ;     //  0x100
        AS3310_REG32		UV_XFER[4]     ;    //  0x110
        AS3310_REG32		TIMING3[4]     ;    //  0x120
        
} /*__attribute__((__packed__))*/ AS3310_LCD_CTRL;

#define AS3310_LCD_CTRL_BASE   0x80084000  /* for AS3310D */

static inline AS3310_LCD_CTRL * AS3310_GetBase_LCD_CTRL(void)
{
	return (AS3310_LCD_CTRL *)(IO_ADDRESS(AS3310_LCD_CTRL_BASE));
}

/*  ==================  CLK Reg defines  =============================*/

typedef struct {
		AS3310_REG32		PLLCTRL0[4]	 ;	            //	0x00	R/W		
		AS3310_REG32		PLLCTRL1[4]   ;             //	0x10	R/W 
		AS3310_REG32		CPUCLKCTRL[4]     ;         //	0x20	R/W 
		AS3310_REG32		HBUSCLKCTRL[4]	 ;          //	0x30	R/W 
		AS3310_REG32		XBUSCLKCTRL[4]   ;          //	0x40	R/W 
		AS3310_REG32		XTALCLKCTRL[4]   ;          //	0x50	R/W 
		AS3310_REG32		OCRAMCLKCTRL[4]      ;      //	0x60	R/W 
		AS3310_REG32		UTMICLKCTRL[4]      ;       //	0x70	R/W	
		AS3310_REG32		SSPCLKCTRL[4]     ;         //	0x80	R/W
		AS3310_REG32		GPMICLKCTRL[4]   ;          //	0x90	R/W 
		AS3310_REG32		SPDIFCLKCTRL[4]      ;      //	0xA0	R/W 
		AS3310_REG32		EMICLKCTRL[4]      ;        //	0xB0	R/W	
		AS3310_REG32		IRCLKCTRL[4]     ;          //	0xC0	R/W
		AS3310_REG32		CLKCTRL_PLL180[4]     ;     //	0xD0	R/W   LCD
} /*__attribute__((__packed__))*/ AS3310_CLK;


/*  ==================  GPMI Reg defines  =============================*/
#if 0
typedef struct {
		AS3310_REG32		CTRL0[4];	            //	0x00	R/W		
		AS3310_REG32		COMP[4];                //	0x10	R/W 
		AS3310_REG32		CTRL1[4];               //	0x20	R/W 
		AS3310_REG32		TIMING0[4];             //	0x30	R/W 
		AS3310_REG32		TIMING1[4];             //	0x40	R/W 
		AS3310_REG32		TIMING2[4];             //	0x50	R/W 
		AS3310_REG32		DATA[4];                //	0x60	R/W 
		AS3310_REG32		STAT[4];                //	0x70	R	
		AS3310_REG32		R_DEBUG[4];             //	0x80	R
} AS3310_GPMI; /*__attribute__((__packed__))*/

#define AS3310_GPMI_BASE	0x8000C000

static inline AS3310_GPMI * AS3310_GetBase_GPMI(void)
{
	return (AS3310_GPMI * ) IO_ADDRESS(AS3310_GPMI_BASE);
}
#endif
/*  ==================  USB Reg defines  =============================*/

typedef struct {
		AS3310_REG32		USB_PHY_PWD[4]	 ;	        //	0x00	R/W		
		AS3310_REG32		USB_PHY_TX[4]   ;           //	0x10	R/W 
		AS3310_REG32		USB_PHY_RX[4]     ;         //	0x20	R/W 
		AS3310_REG32		USB_PHY_CTRL[4]	 ;          //	0x30	R/W 
		AS3310_REG32		USB_PHY_STATUS[4]   ;       //	0x40	R/W 
		AS3310_REG32		USB_PHY_DEBUG[4]   ;        //	0x50	R/W 
		AS3310_REG32		USB_PHY_DEBUG0_STATUS[4] ;  //	0x60	R/W 
		AS3310_REG32		USB_PHY_DEBUG1_STATUS[4] ;  //	0x70	R/W	
		AS3310_REG32		USB_PHY_DEBUG2_STATUS[4] ;  //	0x80	R/W
		AS3310_REG32		USB_PHY_SYS_CTRL[4]   ;     //	0x90	R/W 
		AS3310_REG32		USB_PHY_ANALOG[4]      ;    //	0xA0	R/W 
} /*__attribute__((__packed__))*/ AS3310_USB_PHY_CTRL;

#define AS3310_USB_PHY_CTRL_BASE    0x8007C000

static inline AS3310_USB_PHY_CTRL * AS3310_GetBase_USB_PHY_CTRL(void)
{
	return (AS3310_USB_PHY_CTRL * )IO_ADDRESS(AS3310_USB_PHY_CTRL_BASE);
}

typedef struct asm9260_dma_pkg_s {
		unsigned long		NEXT_PKG	;       //	0x00	R/W		
		unsigned long		CTRL        ;       //	0x04	R/W 
		unsigned long		BUFFER      ;       //	0x08	R/W 
		unsigned long		CMD0        ;       //	0x0c	R/W 
		unsigned long		CMD1        ;       //	0x10	R/W 
} /*__attribute__((__packed__))*/ ASM9260_DMA_PKG;

#endif //__ASSEMBLY__

/*===========================================================================*/
/* Bit Field in AS3310_CLK->XTALCLKCTRL 	0x50	R/W */
#define UART_Clock_Gate             (1<<31)
#define Digi_Filter_Clock_Gate      (1<<30)
#define PWM_Clock_Gate              (1<<29)
#define DRI_Clock_Gate              (1<<28)
#define DIG_Clock_Gate              (1<<27)
#define TIMROT_Clock_Gate           (1<<26)
#define EXRAM_Clock_Gate            (1<<25)
#define LRADC_Clock_Gate            (1<<24)
#define UTMI_120MHz_Clock_Gate      (1<<31)
#define UTMI_30MHz_Clock_Gate       (1<<30)





#endif	/* __ASM_ARCH_AS3310_HARDWARE_H */
